# Модуль для хранения текстов всех инструкций
txt_instruction = '''
Данное приложение позволит вам провести первичную диагностику вашего здоровья.
Проба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке.
Вы должны определить частоту пульса за 15 секунд.
Затем в течение 45 секунд нужно выполнить 30 приседаний. Если у вас нет физической возможности выполнить приседания можно их заменить на другие физические нагрузкию
После окончания нагрузки пульс подсчитывается вновь: число пульсаций за первые 15 секунд, 30 секунд отдыха, число пульсаций за последние 15 секунд.'''

txt_test1 = '''Замерьте пульс за 15 секунд.\n
Результат запишите в соответствующее поле.'''

txt_test2 = '''Выполните 30 приседаний за 45 секунд.\n 
Нажмите кнопку "Начать", чтобы запустить счетчик приседаний.\n
Делайте приседания со скоростью счетчика.'''

txt_test3 = '''В течение минуты замерьте пульс два раза:\n 
за первые 15 секунд минуты, затем за последние 15 секунд.\n
Результаты запишите в соответствующие поля.''' 

txt_sits = 'Выполните 30 приседаний за 45 секунд.'
# Здесь должен быть твой код